Rahix/avr-device/vendor/attiny828.atdf
        <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1A" offset="0x88" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1B" offset="0x8A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x86" size="2" mask="0xFFFF"/>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSRSYNC"/>
        </register>
      </register-group>
      <value-group name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="NO_CLOCK_SOURCE_STOPPED" value="0x00"/>
        <value caption="Running, No Prescaling" name="RUNNING_NO_PRESCALING" value="0x01"/>
        <value caption="Running, CLK/8" name="RUNNING_CLK_8" value="0x02"/>
        <value caption="Running, CLK/64" name="RUNNING_CLK_64" value="0x03"/>
        <value caption="Running, CLK/256" name="RUNNING_CLK_256" value="0x04"/>
        <value caption="Running, CLK/1024" name="RUNNING_CLK_1024" value="0x05"/>
        <value caption="Running, ExtClk Tn Falling Edge" name="RUNNING_EXTCLK_TN_FALLING_EDGE" value="0x06"/>
        <value caption="Running, ExtClk Tn Rising Edge" name="RUNNING_EXTCLK_TN_RISING_EDGE" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter Output Compare Pin" name="TOCPM">
      <register-group caption="Timer/Counter Output Compare Pin" name="TOCPM">
        <register caption="Timer Output Compare Pin Mux Selection 1" name="TOCPMSA1" offset="0xE9" size="1">
          <bitfield caption="Timer Output Compare Channel 7 Selection Bits" mask="0xC0" name="TOCC7S"/>
          <bitfield caption="Timer Output Compare Channel 6 Selection Bits" mask="0x30" name="TOCC6S"/>
          <bitfield caption="Timer Output Compare Channel 5 Selection Bits" mask="0x0C" name="TOCC5S"/>
          <bitfield caption="Timer Output Compare Channel 4 Selection Bits" mask="0x03" name="TOCC4S"/>
        </register>
        <register caption="Timer Output Compare Pin Mux Selection 0" name="TOCPMSA0" offset="0xE8" size="1">
          <bitfield caption="Timer Output Compare Channel 3 Selection Bits" mask="0xC0" name="TOCC3S"/>
          <bitfield caption="Timer Output Compare Channel 2 Selection Bits" mask="0x30" name="TOCC2S"/>
          <bitfield caption="Timer Output Compare Channel 1 Selection Bits" mask="0x0C" name="TOCC1S"/>
          <bitfield caption="Timer Output Compare Channel 0 Selection Bits" mask="0x03" name="TOCC0S"/>
        </register>
        <register caption="Timer Output Compare Pin Mux Channel Output Enable" name="TOCPMCOE" offset="0xE2" size="1">
          <bitfield caption="Timer Output Compare Channel 7 Output Enable" mask="0x80" name="TOCC7OE"/>
          <bitfield caption="Timer Output Compare Channel 6 Output Enable" mask="0x40" name="TOCC6OE"/>
          <bitfield caption="Timer Output Compare Channel 5 Output Enable" mask="0x20" name="TOCC5OE"/>
          <bitfield caption="Timer Output Compare Channel 4 Output Enable" mask="0x10" name="TOCC4OE"/>
          <bitfield caption="Timer Output Compare Channel 3 Output Enable" mask="0x08" name="TOCC3OE"/>
          <bitfield caption="Timer Output Compare Channel 2 Output Enable" mask="0x04" name="TOCC2OE"/>
          <bitfield caption="Timer Output Compare Channel 1 Output Enable" mask="0x02" name="TOCC1OE"/>
          <bitfield caption="Timer Output Compare Channel 0 Output Enable" mask="0x01" name="TOCC0OE"/>
        </register>
      </register-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register A" name="ADMUXA" offset="0x7C" size="1">
          <bitfield caption="Analog Channel Selection Bits 4:0" mask="0x1F" name="MUX"/>
        </register>
        <register caption="The ADC multiplexer Selection Register B" name="ADMUXB" offset="0x7D" size="1">
          <bitfield caption="Reference Selection Bit" mask="0x20" name="REFS"/>
          <bitfield caption="Analog Channel Selection Bit 5" mask="0x01" name="MUX5"/>
        </register>
        <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield mask="0x08" name="ADLAR"/>
          <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER"/>
        </register>
        <register caption="Digital Input Disable Register 2" name="DIDR3" offset="0xDF" size="1">
          <bitfield caption="ADC27 Digital input Disable" mask="0x08" name="ADC27D"/>
          <bitfield caption="ADC26 Digital input Disable" mask="0x04" name="ADC26D"/>
          <bitfield caption="ADC25 Digital input Disable" mask="0x02" name="ADC25D"/>
          <bitfield caption="ADC24 Digital input Disable" mask="0x01" name="ADC24D"/>
        </register>
        <register caption="Digital Input Disable Register 2" name="DIDR2" offset="0xDE" size="1">
          <bitfield caption="ADC23 Digital input Disable" mask="0x80" name="ADC23D"/>
          <bitfield caption="ADC22 Digital input Disable" mask="0x40" name="ADC22D"/>
          <bitfield caption="ADC21 Digital input Disable" mask="0x20" name="ADC21D"/>
          <bitfield caption="ADC20 Digital input Disable" mask="0x10" name="ADC20D"/>
          <bitfield caption="ADC19 Digital input Disable" mask="0x08" name="ADC19D"/>
          <bitfield caption="ADC18 Digital input Disable" mask="0x04" name="ADC18D"/>
          <bitfield caption="ADC17 Digital input Disable" mask="0x02" name="ADC17D"/>
          <bitfield caption="ADC16 Digital input Disable" mask="0x01" name="ADC16D"/>
        </register>
