Rahix/avr-device/vendor/attiny828.atdf
        <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="8"/>
        </register>
        <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
        </register>
        <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
          <bitfield caption="Pin Change Interrupt Flags" mask="0x0F" name="PCIF"/>
        </register>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="LOW_LEVEL_OF_INTX" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="ANY_LOGICAL_CHANGE_OF_INTX" value="0x01"/>
        <value caption="Falling Edge of INTX" name="FALLING_EDGE_OF_INTX" value="0x02"/>
        <value caption="Rising Edge of INTX" name="RISING_EDGE_OF_INTX" value="0x03"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control and Status Register" name="WDTCSR" offset="0x60" size="1">
          <bitfield caption="Watchdog Timer Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timer Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS_32KHZ"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
      <value-group name="WDOG_TIMER_PRESCALE_4BITS_32KHZ">
        <value caption="Oscillator Cycles 512 (16 ms)" name="OSCILLATOR_CYCLES_512_16_MS" value="0x00"/>
        <value caption="Oscillator Cycles 1K (32 ms)" name="OSCILLATOR_CYCLES_1K_32_MS" value="0x01"/>
        <value caption="Oscillator Cycles 2K (64 ms)" name="OSCILLATOR_CYCLES_2K_64_MS" value="0x02"/>
        <value caption="Oscillator Cycles 4K (0.125 s)" name="OSCILLATOR_CYCLES_4K_0_125_S" value="0x03"/>
        <value caption="Oscillator Cycles 8K (0.25 s)" name="OSCILLATOR_CYCLES_8K_0_25_S" value="0x04"/>
        <value caption="Oscillator Cycles 16K (0.5 s)" name="OSCILLATOR_CYCLES_16K_0_5_S" value="0x05"/>
        <value caption="Oscillator Cycles 32K (1.0 s)" name="OSCILLATOR_CYCLES_32K_1_0_S" value="0x06"/>
        <value caption="Oscillator Cycles 64K (2.0 s)" name="OSCILLATOR_CYCLES_64K_2_0_S" value="0x07"/>
        <value caption="Oscillator Cycles 128K (4.0 s)" name="OSCILLATOR_CYCLES_128K_4_0_S" value="0x08"/>
        <value caption="Oscillator Cycles 256K (8.0 s)" name="OSCILLATOR_CYCLES_256K_8_0_S" value="0x09"/>
      </value-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Read/Write Access" name="EEAR" offset="0x41" size="1" mask="0xFF"/>
        <register caption="EEPROM Read/Write Access" name="EEARL" offset="0x41" size="1" mask="0xFF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEProm Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="ERASE_AND_WRITE_IN_ONE_OPERATION" value="0x00"/>
        <value caption="Erase Only" name="ERASE_ONLY" value="0x01"/>
        <value caption="Write Only" name="WRITE_ONLY" value="0x02"/>
      </value-group>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWI Slave Control Register A" name="TWSCRA" offset="0xB8" size="1">
          <bitfield caption="TWI SDA Hold Time Enable" mask="0x80" name="TWSHE"/>
          <bitfield caption="TWI Data Interrupt Enable" mask="0x20" name="TWDIE"/>
          <bitfield caption="TWI Address/Stop Interrupt Enable" mask="0x10" name="TWASIE"/>
          <bitfield caption="Two-Wire Interface Enable" mask="0x08" name="TWEN"/>
          <bitfield caption="TWI Stop Interrupt Enable" mask="0x04" name="TWSIE"/>
          <bitfield caption="TWI Promiscuous Mode Enable" mask="0x02" name="TWPME"/>
          <bitfield caption="TWI Smart Mode Enable" mask="0x01" name="TWSME"/>
        </register>
        <register caption="TWI Slave Control Register B" name="TWSCRB" offset="0xB9" size="1">
          <bitfield caption="TWI High Noise Mode" mask="0x08" name="TWHNM"/>
          <bitfield caption="TWI Acknowledge Action" mask="0x04" name="TWAA"/>
          <bitfield mask="0x03" name="TWCMD"/>
        </register>
        <register caption="TWI Slave Status Register A" name="TWSSRA" offset="0xBA" size="1">
          <bitfield caption="TWI Data Interrupt Flag." mask="0x80" name="TWDIF"/>
          <bitfield caption="TWI Address/Stop Interrupt Flag" mask="0x40" name="TWASIF"/>
          <bitfield caption="TWI Clock Hold" mask="0x20" name="TWCH"/>
          <bitfield caption="TWI Receive Acknowledge" mask="0x10" name="TWRA"/>
          <bitfield caption="TWI Collision" mask="0x08" name="TWC"/>
          <bitfield caption="TWI Bus Error" mask="0x04" name="TWBE"/>
          <bitfield caption="TWI Read/Write Direction" mask="0x02" name="TWDIR"/>
          <bitfield caption="TWI Address or Stop" mask="0x01" name="TWAS"/>
        </register>
        <register caption="TWI Slave Address Register" name="TWSA" offset="0xBC" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="TWI Slave Data Register" name="TWSD" offset="0xBD" size="1" ocd-rw="R">
          <bitfield caption="TWI slave data bit" mask="0xFF" name="TWSD"/>
        </register>
        <register caption="TWI Slave Address Mask Register" name="TWSAM" offset="0xBB" size="1">
          <bitfield caption="TWI Address Mask Bits" mask="0xFE" name="TWSAM" lsb="1"/>
          <bitfield caption="TWI Address Enable" mask="0x01" name="TWAE"/>
        </register>
      </register-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART">
        <register caption="USART I/O Data Register" name="UDR" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status Register A" name="UCSRA" offset="0xC0" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSRB" offset="0xC1" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ2"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSRC" offset="0xC2" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL" values="COMM_USART_MODE"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
        </register>
        <register caption="USART Control and Status Register D" name="UCSRD" offset="0xC3" size="1">
          <bitfield caption="USART RX Start Interrupt Enable" mask="0x80" name="RXSIE"/>
          <bitfield caption="USART RX Start Flag" mask="0x40" name="RXS"/>
          <bitfield caption="USART RX Start Frame Detection Enable" mask="0x20" name="SFDE"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR" offset="0xC4" size="2" mask="0x0FFF"/>
      </register-group>
      <value-group name="COMM_USART_MODE">
        <value caption="Asynchronous Operation" name="ASYNCHRONOUS_OPERATION" value="0x00"/>
        <value caption="Synchronous Operation" name="SYNCHRONOUS_OPERATION" value="0x01"/>
      </value-group>
      <value-group name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="DISABLED" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Enabled, Even Parity" name="ENABLED_EVEN_PARITY" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="ENABLED_ODD_PARITY" value="0x03"/>
      </value-group>
      <value-group name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="1_BIT" value="0x00"/>
        <value caption="2-bit" name="2_BIT" value="0x01"/>
      </value-group>
    </module>
  </modules>
</avr-tools-device-file>
